[
  {
    "level": "Foundations",
    "title": "مقدمة شاملة في الأمن السيبراني",
    "content": "الأمن السيبراني هو مجال يهدف إلى حماية الأنظمة الرقمية، الشبكات، والخوادم من الهجمات الإلكترونية. مع تطور التكنولوجيا، أصبحت الهجمات أكثر تعقيدًا، مما جعل الأمن السيبراني ضرورة وليس خيارًا. يشمل هذا المجال حماية البيانات، منع الاختراق، اكتشاف الهجمات، والاستجابة لها."
  },
  {
    "level": "Foundations",
    "title": "تاريخ وتطور الهجمات الإلكترونية",
    "content": "بدأت الهجمات الإلكترونية بشكل بسيط مثل الفيروسات، ثم تطورت إلى هجمات معقدة مثل هجمات الفدية (Ransomware) والاختراقات الموجهة. فهم تطور الهجمات يساعد المختص على توقع التهديدات المستقبلية."
  },
  {
    "level": "Foundations",
    "title": "أنواع الهاكرز بالتفصيل",
    "content": "الهاكر الأخلاقي يعمل بإذن لحماية الأنظمة، الهاكر الضار يستغل الثغرات لأغراض إجرامية، الهاكر الرمادي يعمل بدون إذن لكنه لا يهدف دائمًا للضرر. هناك أيضًا Script Kiddies وHacktivists."
  },
  {
    "level": "Foundations",
    "title": "أنواع الهجمات الإلكترونية",
    "content": "تشمل الهجمات: التصيد الاحتيالي، البرمجيات الخبيثة، هجمات القوة الغاشمة، هجمات الحرمان من الخدمة، وهجمات الهندسة الاجتماعية."
  },
  {
    "level": "Foundations",
    "title": "مفهوم المخاطر والتهديدات",
    "content": "الخطر هو احتمال وقوع هجوم، أما التهديد فهو الفاعل الذي ينفذ الهجوم. إدارة المخاطر جزء أساسي من الأمن السيبراني."
  },
  {
    "level": "Foundations",
    "title": "مقدمة في أنظمة التشغيل",
    "content": "أنظمة التشغيل هي الأساس الذي تعمل عليه الأجهزة. أشهرها Windows وLinux. فهم طريقة عملها ضروري لاكتشاف الثغرات وحمايتها."
  },
  {
    "level": "Foundations",
    "title": "لينكس ولماذا يستخدم في الأمن السيبراني",
    "content": "لينكس نظام مفتوح المصدر، مستقر وآمن. معظم أدوات الأمن السيبراني مثل Kali Linux مبنية عليه، مما يجعله الخيار الأول للمختصين."
  },
  {
    "level": "Foundations",
    "title": "أساسيات الطرفية Terminal",
    "content": "الطرفية تتيح التحكم الكامل بالنظام باستخدام الأوامر. استخدامها أساسي في تحليل الأنظمة وتنفيذ أدوات الأمن."
  },
  {
    "level": "Networking",
    "title": "ما هي الشبكات؟ شرح شامل",
    "content": "الشبكات تسمح للأجهزة بالتواصل وتبادل البيانات. الإنترنت هو شبكة عالمية تربط ملايين الأجهزة باستخدام بروتوكولات محددة."
  },
  {
    "level": "Networking",
    "title": "أنواع الشبكات",
    "content": "تشمل LAN، WAN، MAN، وWLAN. كل نوع يستخدم في بيئة مختلفة حسب الحجم والاحتياج."
  },
  {
    "level": "Networking",
    "title": "نموذج OSI",
    "content": "نموذج OSI يتكون من 7 طبقات، يشرح كيف تنتقل البيانات من التطبيق إلى الشبكة والعكس. فهمه ضروري لتحليل الهجمات."
  },
  {
    "level": "Networking",
    "title": "TCP/IP بالتفصيل",
    "content": "TCP/IP هو النموذج المستخدم فعليًا في الإنترنت. يحدد كيفية تقسيم البيانات، إرسالها، وإعادة تجميعها."
  },
  {
    "level": "Networking",
    "title": "عناوين IP",
    "content": "عنوان IP هو معرف رقمي لكل جهاز. يوجد IPv4 وIPv6. فهمه ضروري لفهم الهجمات الشبكية."
  },
  {
    "level": "Networking",
    "title": "المنافذ والخدمات",
    "content": "المنافذ هي نقاط اتصال للخدمات. مثل HTTP على 80 وHTTPS على 443. استغلال المنافذ المفتوحة أحد طرق الهجوم."
  },
  {
    "level": "Networking",
    "title": "DNS بعمق",
    "content": "DNS يحول أسماء النطاقات إلى IP. الهجوم عليه قد يؤدي إلى إعادة توجيه المستخدمين لمواقع مزيفة."
  },
  {
    "level": "Networking",
    "title": "HTTP و HTTPS",
    "content": "HTTP ينقل البيانات بدون تشفير، بينما HTTPS يستخدم SSL/TLS لتأمين الاتصال."
  },
  {
    "level": "Networking",
    "title": "الجدران النارية Firewalls",
    "content": "الجدار الناري يتحكم في حركة المرور بين الشبكات ويمنع الاتصالات غير المصرح بها."
  },
  {
    "level": "Networking",
    "title": "VPN",
    "content": "VPN ينشئ نفقًا مشفرًا لحماية الاتصال، ويستخدم لإخفاء الهوية وتأمين البيانات."
  }
]
