{
  "Foundations": [
    {
      "title": "Cyber Security Introduction",
      "image": "intro.png",
      "content": "الأمن السيبراني هو مجال يهتم بحماية الأنظمة الحاسوبية والشبكات والبيانات من الهجمات الرقمية. يشمل ذلك حماية المعلومات من السرقة، التخريب، أو الوصول غير المصرح به. مع تطور التكنولوجيا وزيادة الاعتماد على الإنترنت، أصبح الأمن السيبراني عنصرًا أساسيًا في حياة الأفراد والشركات والحكومات."
    },
    {
      "title": "Why Cyber Security is Important",
      "image": "importance.png",
      "content": "تكمن أهمية الأمن السيبراني في حماية البيانات الحساسة مثل المعلومات الشخصية، البيانات البنكية، وأسرار الشركات. أي اختراق قد يؤدي إلى خسائر مالية كبيرة، تشويه السمعة، أو حتى تهديد الأمن الوطني. لذلك، تعتمد المؤسسات على استراتيجيات أمنية قوية لتقليل المخاطر."
    },
    {
      "title": "What is a Hacker?",
      "image": "hacker.png",
      "content": "الهاكر هو شخص يمتلك معرفة تقنية عميقة بالأنظمة والشبكات. لا يعني مصطلح هاكر دائمًا شخصًا سيئًا، فهناك هاكر أخلاقي يعمل على حماية الأنظمة من خلال اكتشاف الثغرات قبل أن يستغلها المهاجمون."
    },
    {
      "title": "Types of Hackers",
      "image": "types.png",
      "content": "ينقسم الهاكرز إلى عدة أنواع: الهاكر الأخلاقي (White Hat) الذي يعمل بشكل قانوني، الهاكر الخبيث (Black Hat) الذي يستغل الثغرات لأغراض إجرامية، والهاكر الرمادي (Grey Hat) الذي يقع بين الاثنين."
    },
    {
      "title": "CIA Triad",
      "image": "cia.png",
      "content": "نموذج CIA Triad هو أساس الأمن السيبراني ويتكون من ثلاثة عناصر: السرية (Confidentiality) وتعني حماية البيانات من الوصول غير المصرح به، السلامة (Integrity) وتعني الحفاظ على صحة البيانات، والتوافر (Availability) وتعني ضمان الوصول إلى البيانات عند الحاجة."
    },
    {
      "title": "Common Cyber Threats",
      "image": "threats.png",
      "content": "تشمل التهديدات السيبرانية الشائعة البرمجيات الخبيثة، التصيد الاحتيالي، هجمات حجب الخدمة، وهجمات الهندسة الاجتماعية. تعتمد هذه الهجمات غالبًا على خداع المستخدم أو استغلال ثغرات تقنية."
    },
    {
      "title": "Malware Overview",
      "image": "malware.png",
      "content": "البرمجيات الخبيثة هي برامج مصممة لإلحاق الضرر بالأنظمة، مثل الفيروسات، أحصنة طروادة، وبرامج التجسس. يمكن أن تؤدي إلى سرقة البيانات أو السيطرة على الجهاز دون علم المستخدم."
    },
    {
      "title": "Phishing Attacks",
      "image": "phoishing.png",
      "content": "التصيد الاحتيالي هو أسلوب خداعي يتم فيه إرسال رسائل أو مواقع مزيفة لإقناع الضحية بإدخال معلومات حساسة مثل كلمات المرور أو بيانات البطاقة البنكية."
    },
    {
      "title": "Strong Passwords",
      "image": "password.png",
      "content": "كلمة المرور القوية هي خط الدفاع الأول. يجب أن تحتوي على أحرف كبيرة وصغيرة وأرقام ورموز، وألا تكون سهلة التخمين أو مستخدمة في أكثر من موقع."
    },
    {
      "title": "Cyber Security Career Path",
      "image": "career.png",
      "content": "مجال الأمن السيبراني يوفر فرص عمل متعددة مثل محلل أمن معلومات، مختبر اختراق، مهندس أمن شبكات. يتطلب هذا المجال التعلم المستمر ومتابعة أحدث التهديدات والتقنيات."
    }
  ]
}
